app/Controllers/Home.php

    public function gravar(){
        $data['session'] = \Config\Services::session();

        if(!$data['session']->get('logado')){
            return redirect("login");
        }

        $model = new PessoasModel();

        $model->save([
            'id' => $this->request->getVar('id'),
            'nome' => $this->request->getVar('nome'),
            'profissao' => $this->request->getVar('profissao'),
            'idade' => $this->request->getVar('idade')
        ]);
---
INSERT INTO `tb_pessoas` (`nome`, `profissao`, `idade`) VALUES ('dd', 'dd', '20')