app/Models/PessoasModel.php

SELECT *
FROM `tb_pessoas`
WHERE `id` = '6'
 LIMIT 1
---
    public function getPessoa($id){
        return $this->asArray()->where(['id'=>$id])->first();